rkz/extension/DataProcessors/ПодборСерийВДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПодборСерийВДокументы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_Намотки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

rkz/extension/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВидЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипОбшивкиБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесОбшивки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесБарабана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПрежнийНомерТары</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Намотки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереченьДлинНаБарабане</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

rkz/extension/DataProcessors/ПодборСерийВДокументы/Forms/РегистрацияИПодборСерийПоОднойСтрокеТоваров/Ext/Form/Module.bsl
&Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	
	КвалификаторЧисла10_0 = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло10_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_0);
	КвалификаторыСтроки40 = Новый КвалификаторыСтроки(40);
	ОписаниеСтроки40 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки40);
	КвалификаторЧисла9_3 = Новый КвалификаторыЧисла(9,3);
	ОписаниеЧисло9_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла9_3);
	КвалификаторыСтроки1024 = Новый КвалификаторыСтроки(1024);
	ОписаниеСтроки = Новый ОписаниеТипов("Строка", , , КвалификаторыСтроки1024);
	ОписаниеНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
	ДобавляемыеРеквизитыОстаткиСерий =  Новый Массив; 
	
	бит_НомерЗаказаОстатки = Новый РеквизитФормы("бит_НомерЗаказаОстатки", ОписаниеЧисло10_0, "ОстаткиСерий", "(бит) № заказа");
	бит_НамоткиОстатки = Новый РеквизитФормы("бит_НамоткиОстатки", ОписаниеСтроки40, "ОстаткиСерий", "(бит) Намотки");
	бит_БруттоОстатки = Новый РеквизитФормы("бит_БруттоОстатки", ОписаниеЧисло9_3, "ОстаткиСерий", "(бит) Брутто, кг");
	бит_ПримечаниеОстатки = Новый РеквизитФормы("бит_ПримечаниеОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Примечание");
	//бит_ТараОстатки = Новый РеквизитФормы("бит_ТараОстатки", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тара");
	бит_ПрежнийНомерТарыОстатки = Новый РеквизитФормы("бит_ПрежнийНомерТарыОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Прежний № тары");
	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗаказаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НамоткиОстатки); 
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_БруттоОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПримечаниеОстатки);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТараОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПрежнийНомерТарыОстатки);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизитыОстаткиСерий);
	
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_НомерЗаказа", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_НомерЗаказаОстатки";
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Намотки", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_НамоткиОстатки";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Брутто", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_БруттоОстатки";
	
	//(бит) Примечание
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Примечание", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПримечаниеОстатки";
	
	//(бит) Тара
	//НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Тара", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТараОстатки";
	
	//(бит) Прежний № тары
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПрежнийНомерТарыОстатки";

	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("Сериибит_НомерЗаказа", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_НомерЗаказа";
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("Сериибит_Намотки", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Намотки";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("Сериибит_Брутто", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Брутто";
	
	//(бит) Примечание
	НовыйЭлемент = Элементы.Вставить("Сериибит_Примечание", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Примечание";
	
	//(бит) Тара
	//НовыйЭлемент = Элементы.Вставить("Сериибит_Тара", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Тара";
	
	//(бит) Прежний № тары
	НовыйЭлемент = Элементы.Вставить("Сериибит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ПрежнийНомерТары";
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 17:05:54] +        
	
	// СЕРИИ
	
	НовыйЭлемент = Элементы.Вставить("Сериибит_ВидЗаказа", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВидЗаказа";
	
	НовыйЭлемент = Элементы.Вставить("Сериибит_Партия", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Партия";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ТипОбшивкиБарабана";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ТипБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ТипБарабана";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесПродукции", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесПродукции";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесОбшивки", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесОбшивки";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесБарабана";
	
	//НовыйЭлемент = Элементы.Вставить("Сериибит_ПереченьДлинНаБарабанеСтрокой", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ПереченьДлинНаБарабанеСтрокой"; 
	
	НовыйЭлемент = Элементы.Вставить("Сериибит_Цвет", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Цвет";

	// ОСТАТКИ СЕРИЙ
	
	ДобавляемыеРеквизитыОстаткиСерий =  Новый Массив; 
	
	ОписаниеЧисло2_0 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеЧисло7_0 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный));
	
	бит_ВидЗаказаОстатки = Новый РеквизитФормы("бит_ВидЗаказаОстатки", ОписаниеЧисло2_0, "ОстаткиСерий", "(бит) Вид заказа");
	бит_ПартияОстатки = Новый РеквизитФормы("бит_ПартияОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Партия");
	бит_ТипОбшивкиБарабанаОстатки = Новый РеквизитФормы("бит_ТипОбшивкиБарабанаОстатки", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тип обшивки барабана");
	бит_ТипБарабанаОстатки = Новый РеквизитФормы("бит_ТипБарабанаОстатки", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тип барабана");
	бит_ВесПродукцииОстатки = Новый РеквизитФормы("бит_ВесПродукцииОстатки", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес продукции");
	бит_ВесОбшивкиОстатки = Новый РеквизитФормы("бит_ВесОбшивкиОстатки", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес обшивки");
	бит_ВесБарабанаОстатки = Новый РеквизитФормы("бит_ВесБарабанаОстатки", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес барабана");
	//бит_ПереченьДлинНаБарабанеСтрокойОстатки = Новый РеквизитФормы("бит_ПереченьДлинНаБарабанеСтрокойОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Перечень длин на барабане");
    бит_ЦветОстатки = Новый РеквизитФормы("бит_ЦветОстатки", Новый ОписаниеТипов("СправочникСсылка.бит_Цвета") , "ОстаткиСерий", "(бит) Цвет");
	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВидЗаказаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПартияОстатки); 
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипОбшивкиБарабанаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипБарабанаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесПродукцииОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесОбшивкиОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесБарабанаОстатки);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПереченьДлинНаБарабанеСтрокойОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ЦветОстатки);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизитыОстаткиСерий);

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВидЗаказа", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВидЗаказаОстатки";
	
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Партия", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПартияОстатки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТипОбшивкиБарабанаОстатки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ТипБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТипБарабанаОстатки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесПродукции", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесПродукцииОстатки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесОбшивки", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесОбшивкиОстатки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесБарабанаОстатки";
	
	//НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ПереченьДлинНаБарабанеСтрокой", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПереченьДлинНаБарабанеСтрокойОстатки";
	
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Цвет", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ЦветОстатки";
	

	// }}ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 17:05:54] -
	
КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 20:18:35] +        
	Если Параметры.Свойство("Регистратор") Тогда                                          
		МассивТиповРегистратора = Новый Массив;
		МассивТиповРегистратора.Добавить(Тип("ДокументСсылка.ЭтапПроизводства2_2"));
		МассивТиповРегистратора.Добавить(Тип("ДокументСсылка.ПроизводствоБезЗаказа"));                       
		МассивТиповРегистратора.Добавить(Тип("ДокументСсылка.ПроизводственнаяОперация2_2"));
		МассивТиповРегистратора.Добавить(Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов"));                       
		Если МассивТиповРегистратора.Найти(ТипЗнч(Параметры.Регистратор)) <> Неопределено Тогда
			НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_АтрибутыТары");
			НоваяКоманда.Заголовок = "Атрибуты тары";
			НоваяКоманда.Действие = "бит_АтрибутыТары";
			
			НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_АтрибутыТары", Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанельТаблицы, Элементы.ГруппаКомандыРаботыСоШтрихкодами);
			НовыйЭлемент.Заголовок = "Атрибуты тары";
			НовыйЭлемент.ИмяКоманды = "бит_АтрибутыТары";  
			
			ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов    
			НовыйРеквизит = Новый РеквизитФормы("бит_Регистратор", Новый ОписаниеТипов(МассивТиповРегистратора)); 
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);          
			НовыйРеквизит = Новый РеквизитФормы("бит_Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
			НовыйРеквизит = Новый РеквизитФормы("бит_Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения")); 
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
			
			
			ЭтаФорма.бит_Регистратор = Параметры.Регистратор;     
			ЭтаФорма.бит_Номенклатура = Параметры.Номенклатура;
			Если Параметры.Свойство("Назначение") Тогда
				Назначение = Параметры.Назначение;
			Иначе
				Назначение = Параметры.НазначениеОтправителя;
			КонецЕсли;
			ЭтаФорма.бит_Назначение = Назначение;
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 20:18:35] -
КонецПроцедуры 

&НаКлиенте
Процедура бит_АтрибутыТары(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] + 
	ИмяТЧ = "ВыходныеИзделия";
	ИмяТЧСерии = "ВыходныеИзделияСерии";
	
	ТД = Элементы.Серии.ТекущиеДанные;
	Если ТД <> Неопределено И ЗначениеЗаполнено(ТД.Серия) Тогда
		ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
							ТД.Серия,
							ЭтаФорма.бит_Регистратор, 
							ЭтаФорма.бит_Номенклатура,
							Упаковка,  
							ТД.Количество,
							ТД.КоличествоУпаковок,
							ЭтаФорма.бит_Назначение,
							НомераСтрокПредставление);	
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаАтрибутыТары", ПФ, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] -
КонецПроцедуры
